In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import sqlite3

In [2]:
database = 'UWMadisondatabase.sqlite3'

In [3]:
conn = sqlite3.connect(database)

In [4]:
cursor = conn.cursor()

In [6]:
tables = pd.read_sql("""SELECT name FROM sqlite_master
                        WHERE type= 'table'; """,conn)
tables

                  name
0             sections
1          instructors
2     course_offerings
3  subject_memberships
4              courses
5                rooms
6            teachings
7             subjects
8            schedules
9  grade_distributions

So, we have 10 tables in all.

In [7]:
subjects = pd.read_sql("""SELECT * FROM subjects;""", conn)
subjects

    code                                  name abbreviation
0    908                          Soil Science     SOIL SCI
1    350                               ENGLISH      ENGLISH
2    351          English as a Second Language          ESL
3    230  Human Development and Family Studies         HDFS
4    352                               English         ENGL
..   ...                                   ...          ...
195  348  Engineering Professional Development        E P D
196  106                 Afro-American Studies     AFROAMER
197  228        Chicana/o and Latina/o Studies       CHICLA
198  108    Agricultural and Applied Economics        A A E
199  900                             Sociology          SOC

[200 rows x 3 columns]

In [11]:
order_subjects = pd.read_sql("""SELECT * FROM subjects
                                ORDER BY code; """, conn)
order_subjects

    code                                            name abbreviation
0    102                     Air Force Aerospace Studies     A F AERO
1    104                African Languages and Literature      AFRICAN
2    106                           Afro-American Studies     AFROAMER
3    108              Agricultural and Applied Economics        A A E
4    112                  Biological Systems Engineering          BSE
..   ...                                             ...          ...
195  960                                WILDLIFE ECOLOGY      WL ECOL
196  963                      Gender and Women’s Studies       GEN&WS
197  970                                         Zoology      ZOOLOGY
198  SAB  International Academic Programs - Study Abroad     STDYABRD
199  ZZZ                    Registrar-Administrative Use     AdminUse

[200 rows x 3 columns]

How many subject names have English in them?

In [16]:
eng_sub = pd.read_sql("""SELECT * FROM subjects
                         WHERE name LIKE '%english%';""", conn)
eng_sub

  code                          name abbreviation
0  350                       ENGLISH      ENGLISH
1  351  English as a Second Language          ESL
2  352                       English         ENGL

How many subjects are Science based?

In [17]:
sci_sub = pd.read_sql("""SELECT * FROM subjects
                         WHERE name LIKE '%science%' ;""", conn)
sci_sub

   code                                             name abbreviation
0   908                                     Soil Science     SOIL SCI
1   120                      Life Sciences Communication          LSC
2   242                                Actuarial Science      ACT SCI
3   252             Communication Sciences and Disorders         CS&D
4   810                       Population Health Sciences     POP HLTH
5   934                          Comparative Biosciences     COMP BIO
6   938                                Surgical Sciences     SURG SCI
7   939  Therapeutic Science (Department of Kinesiology)     THER SCI
8   266                                Computer Sciences     COMP SCI
9   702                Ophthalmology and Visual Sciences     OPHTHALM
10  703                        Patho-Biological Sciences     PATH-BIO
11  390                                     Food Science     FOOD SCI
12  271                                 Consumer Science     CNSR SCI
13  952            ANIMAL HEALTH AND BIOMEDICAL SCIENCES        AHABS
14  718                          Pharmaceutical Sciences      PHM SCI
15  604                                  Animal Sciences       AN SCI
16  292                                    Dairy Science       DY SCI
17  622                Medical Sciences - Medical School     MED SC-M
18  623           Medical Sciences - Veterinary Medicine     MED SC-V
19  503                               Integrated Science     INTEGSCI
20  628                      CLINICAL LABORATORY SCIENCE     CLNLABSC
21  875                   Science and Technology Studies          STS
22  636                Materials Science and Engineering      M S & E
23  640                 Atmospheric and Oceanic Sciences      ATM OCN
24  644                                 Military Science      MIL SCI
25  778                                Political Science     POLI SCI
26  420                                       Geoscience       GEOSCI
27  672                                    Naval Science      NAV SCI
28  681                                     Neuroscience     NEURODPT
29  682                    Neuroscience Training Program          NTP
30  694                             Nutritional Sciences     NUTR SCI
31  456                               History of Science     HIST SCI